# Задача 1. Напишите программу, которая на вход принимает два числа A и B, и возводит число А 
# в целую степень B с помощью рекурсии.

# import Def
# a = int(input("Введите число: "))
# b = int(input("Введите степень, в которую Вы хотите возвести число: "))
# print(Def.power(a, b))

# Задача 2. Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаютс2
# 2я только +1 и -1. Также нельзя использовать циклы.

import Def
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print(Def.sum(a, b))