# Задача 1. Напишите программу, которая на вход принимает два числа A и B, и возводит число А 
# в целую степень B с помощью рекурсии.

import Def
a = int(input('Введите число: '))
b = int(input('Введите степень: '))
print(Def.power(a, b))